List<Map<String, dynamic>> get timeGreetings => [
      {
        'time': '05:00-10:59',
        'greetings': [
          '早上好~',
          'Good Morning☀️',
          '元气满满新的一天🤩',
          '清晨阳光灿烂✨',
          '新的一天新气象🌟',
          '早起的鸟儿有虫吃🐦',
          '学习加油哦💪'
        ]
      },
      {
        'time': '11:00-12:59',
        'greetings': ['中午好~', '今天也要吃饱饱🥰', '午饭时间到🍔', '想好吃什么了吗😋']
      },
      {
        'time': '13:00-16:59',
        'greetings': ['下午好~', '来点小甜品🍰', '学习加油哦💪']
      },
      {
        'time': '17:00-21:59',
        'greetings': ['晚上好~', '夜幕降临✨', '学习加油哦💪']
      },
      {
        'time': '22:00-23:59',
        'greetings': [
          '夜深了~',
          '明天见😊',
          '睡个好觉做个美梦🌙',
          '夜猫子还在忙碌吗💻',
          '愿你有个宁静的夜晚💫'
        ]
      }
    ];
