List<Map<String, dynamic>> get timeGreetings => [
      {
        'time': '00:00-04:59',
        'greetings': [
          '已经很晚了🌃',
          '早点睡哦💤',
          '熬夜小心身体哦🛌',
          '星空陪着你✨',
          '夜猫子模式开启🦉',
          '再坚持一下就该睡觉啦🕰️',
          '夜晚的校园安静而美丽🌙',
          '夜深了，别忘了喝口热水☕',
          '做个好梦吧🌌'
        ]
      },
      {
        'time': '05:00-10:59',
        'greetings': [
          '早上好~',
          'Good Morning☀️',
          '元气满满新的一天🤩',
          '清晨阳光灿烂✨',
          '新的一天新气象🌟',
          '早起的鸟儿有虫吃🐦',
          '学习加油哦💪',
          '晨跑结束了吗🏃‍♂️',
          '早餐记得吃哦🥪',
          '校园的早晨最美好🍃'
        ]
      },
      {
        'time': '11:00-12:59',
        'greetings': [
          '中午好~',
          '今天也要吃饱饱🥰',
          '午饭时间到🍔',
          '想好吃什么了吗😋',
          '别忘了喝汤哦🍵',
          '校园里的午后阳光温暖☀️',
          '午休时间来啦🛏️',
          '放松一下吧📖',
          '饭卡余额还够吗💳'
        ]
      },
      {
        'time': '13:00-16:59',
        'greetings': [
          '下午好~',
          '来点小甜品🍰',
          '学习加油哦💪',
          '实验室忙起来了吗🔬',
          '图书馆静悄悄📚',
          '校园下午茶时光☕',
          '课间别忘了多走动🏃',
          '努力学习，为梦想加油🌈',
          '今天的课程有收获吗📘',
          '在课堂上坚持住！🎓'
        ]
      },
      {
        'time': '17:00-21:59',
        'greetings': [
          '晚上好~',
          '夜幕降临✨',
          '学习加油哦💪',
          '吃晚饭了吗🍛',
          '操场夜跑时间到🏃‍♀️',
          '社团活动有趣吗🎭',
          '晚风吹过校园🌬️',
          '和朋友一起夜聊吧🗣️',
          '记得留点时间休息🌙'
        ]
      },
      {
        'time': '22:00-23:59',
        'greetings': [
          '夜深了~',
          '明天见😊',
          '睡个好觉做个美梦🌙',
          '夜猫子还在忙碌吗💻',
          '愿你有个宁静的夜晚💫',
          '一天的努力辛苦啦💼',
          '复习到哪里了📒',
          '准备关灯睡觉吧🛌',
          '晚安，西科人🌌',
          '希望梦里都是快乐的事情✨'
        ]
      }
    ];
